<?php

//Конфигурационные переменные для всей программы

class Config
{
	
	//Подключение к DB
	public static $host			= 'localhost';
	public static $login		= 'root';
	public static $password 	= '';
	public static $db_name		= 'onyx';
	
	//Список баз данных 
	public static $listOfDb = array (
			// [db_class_name == file name without '.php'] = db_name
			'Data_Base_Drfo_2007'						=> 'База даних ДРФО 2007 рік',
			'Data_Base_Telefony_Kiev_Kievoblast_2007' 	=> 'База даних телефони Києва та Київської області 2007 рік',
			'Data_Base_Vybory_2014_Ukrayina'			=> 'База даних Виборці України 2014 рік',
			'Data_Base_Contract_Subscriber_Kievstar'	=> 'База даних Контрактні абоненти Київстар'
	);

	//Словарь полей поиска
	public static $listOfSearchFieldsNames = array (
			'lastname'		=> 'Прізвище',
//			'lastname_ru'	=> 'Прізвище російською',
			'firstname'		=> 'Ім\'я',
//			'firstname_ru'	=> 'Ім\'я російською',
			'middlename'	=> 'По батькові',
//			'middlename_ru' => 'По батькові російською',
			'birthdate'		=> 'Дата народження',
			'adress'		=> 'Адреса',
			'telephone'		=> 'Телефон',
			'drfo_code'		=> 'Код ДРФО',
			'company'		=> 'Підприємство',
			'birthplace'	=> 'Місце народження',
//			'work_place'	=> 'Місце роботи',
			'edrpou'		=> 'ЄДРПОУ'
	);
	
	public static $listOfResultFields = array(
			'drfo' 							=> 'Код ДРФО:',
			'lastname' 						=> 'Прізвище:',
			'lastname_ru' 					=> 'Прізвище, російською:',
			'firstname' 					=> 'Ім\'я:',
			'firstname_ru' 					=> 'Ім\'я, російською:',
			'middlename' 					=> 'По батькові:',
			'middlename_ru' 				=> 'По батькові, російською:',
			'date_acquired_code' 			=> 'Дата отримання коду ДРФО:',
			'birthdate' 					=> 'Дата народження:',
			'birth_adress' 					=> 'Місце народження:',
			'birth_place_name_abroad'		=> 'Назва населеного пункту місяця народження закордоном:',
			'registration_date'				=> 'Дата реєстрації коду ДРФО:',
			'drfo_2' 						=> '2-й код ДРФО:',
			'language' 						=> 'Мова:',
			'stat'							=> 'Стать:',
			'date_acquired_code_2i' 		=> 'Дата отримання 2-го коду ДРФО:',
			'change_date' 					=> 'Дата внесення змін (ДРФО):',
			'liquidation_date' 				=> 'Дата ліквідації:',
			'organ_dpi' 					=> 'Орган ДПІ:',
			'adress' 						=> 'Адреса:',
			'telephone' 					=> 'Телефон:',
			'code_registration_date' 		=> 'Дата реєстрації коду ДРФО:',
			'edrpou' 						=> 'ЄДРПОУ:',
			'employer_drfo' 				=> 'Код ДРФО роботодавця:',
			'year_of_employment' 			=> 'Дата працевлаштування:',
			'date_of_dismissal' 			=> 'Дата звільнення:',
			'company' 						=> 'Підприємство',
			//'installation_date' 			=> 'Дата установки телефона:',
			'installation_date' 			=> 'Дата установки:',
			'accountant_telephone' 			=> 'Телефон бухгалтера',
			'okpo' 							=> 'ОКПО:',
			'correction_date' 				=> 'Дата внесення змін (телефон)',
			'registration_date_telephone'	=> 'Дата реєстрації телефону (Київстар)',
			'additional_telephone'			=> 'Додатковий телефон'
	);
	
	
	public static $listOfSearchFieldsHints = array (
			'lastname'		=> "Дозволяється використовувати &#39;_&#39; та &#39;%&#39; але це значно уповільнює пошук",
//			'lastname_ru'	=> 'Прізвище російською',
			'firstname'		=> "Дозволяється використовувати &#39;_&#39; та &#39;%&#39; але це значно уповільнює пошук",
//			'firstname_ru'	=> 'Ім\'я російською',
			'middlename'	=> "Дозволяється використовувати &#39;_&#39; та &#39;%&#39; але це значно уповільнює пошук",
//			'middlename_ru' => "По батькові російською",
			'birthdate'		=> "Повна дата (ДД.ММ.РРРР, розділювачі: &#39;.&#39;, &#39;-&#39;, &#39;,&#39;(через крапку, дефіз чи кому)) чи лише рік (РРРР)",
			'adress'		=> "Вводити через пробіл (Область, місто, вулиця, будинок, квартира тощо), приклад: &#39;Київ Богомольця 8 23&#39;, де 1-ша цифра &#39;8&#39; - номер будинку, 2-га цифра &#39;23&#39; - номер квартири. Якщо потрібно уточнення, що цифра стоється саме будинку, вводити &#39;буд.8&#39; слово &#39;буд.&#39; разом з цифрою, якщо потрібно уточнення квартири, так само вводити &#39;кв.&#39;, приклад: &#39;Київ Богомольця буд.8 кв.23&#39;. Номера будинків з літерою та через дріб вводити разом, приклад: &#39;11г&#39;, &#39;10/22&#39;",
			'telephone'		=> "Тільки цифри, або цифри через розділювач &#39;-&#39;, дозволяється використовувати &#39;_&#39; та &#39;%&#39;",
			'drfo_code'		=> "Тільки 10 цифр коду",
			'company'		=> "Слово або декілька слів через пробіл, тільки букви, без цифр",
			'birthplace'	=> "Слово або декілька слів через пробіл, тільки букви, без цифр",
//			'work_place'	=> "Місце роботи",
			'edrpou'		=> "Тільки цифри, або цифри через розділювач &#39;-&#39;, дозволяється використовувати &#39;_&#39; та &#39;%&#39;"
	);	
	
	
}

?>